[
    {
        "Telegram_message": "More than 25,000 now killed in Gaza since Israel offensive began, Hamas-run health ministry says\n\nMore than 25,000 people have now been killed in Gaza during Israel's offensive there, according to the Hamas-run health ministry.\n\nIt said there had been 178 deaths in the last 24 hours, making it one of the deadliest days in the war so far.\n\nAs fighting continued, Israel's Prime Minister Benjamin Netanyahu again rejected creating a Palestinian state.",
        "GDELT_message": "Along with the United States, several countries have listed Hamas as a terrorist organization. The group considers itself a liberation movement for Palestinians against Israeli occupation.\n\nThe U.S. has designated Hamas as a terrorist organization three times, says Matthew Levitt, a specialist on Hamas at the Washington Institute of Near East Policy.\n\n“The first time predates the current terrorism lists and came in the process of the peace process under the Clinton administration in 1995,” he said. The Clinton White House had an executive order, a law banning groups that were threatening the peace process. That included Islamist groups like Hamas and Palestinian Islamic Jihad, and also Jewish extremist groups like Kach and Kahane Chai.”\n\nTwo years later, the U.S. created a new terrorism list.\n\n“Then in 1997, the State Department initiated its Foreign Terrorist Organization or FTO list, which is specific to terrorist groups,” Levitt said. “And Hamas was added to that list because of the acts of terrorism it was conducting not only because it was threatening the peace process but it was at that point carrying out shooting attacks, stabbing attacks and beginning to carry out suicide bombings quite frequently as well.”\n\nThe third time, according to Levitt, came after 9/11 attacks on the U.S. when the Bush administration created a special global terrorism list.\n\nLevitt explained how Hamas fits the definition of a terrorist organization.\n\n“The simple, most basic definition is targeting civilians for the purpose of effecting social or political change,” he said. \"Personally, I simplify it a little bit more: It’s about the tactic. Terrorism is a tactic and if you engage in this tactic of targeting civilians for the purpose of effecting social and political change then that act is an act of terrorism.”\n\nIn its 1988 manifesto, Hamas called for the destruction of Israel. Years later, in 2017, Hamas dropped that language.\n\nBut it continued to incessantly fire rockets into Israeli communities.\n\nOn October 7, thousands of Hamas gunmen stormed into Israel killing 1,200 people, most of them civilians, according to Israeli tallies, and took over more than 20 Israeli kibbutzim and other communities. Among the dead were at least 30 Israelis who also had U.S. citizenship.\n\nIsrael responded to the Hamas attack with a war against Hamas in Gaza.\n\nThe Hamas-run Palestinian Health Ministry in Gaza says more than 27,000 Palestinians have been killed, although that includes both fighters and civilians. Israel says it has killed an estimated 10,000 Hamas fighters, about one third of Hamas’s total force.\n\nIsrael says its forces in Gaza are carrying out precision attacks and are not targeting civilians. It says civilian deaths that are occurring are unintentional.\n\nThe growing civilian death toll and humanitarian crisis in Gaza have led to growing international pressure on Israel to stop the war. The U.S. says that Gaza must eventually be run by a revitalized Palestinian Authority, an idea that Israeli Prime Minister Benjamin Netanyahu has rejected.\n\nHamas, which has ruled Gaza since 2007, is rejecting it too. In a recent interview with a Kuwaiti journalist, former Hamas senior official Khaled Mashaal, who lives in Qatar, rejected the idea of recognizing Israel, and said that the October 7 attack proved that the idea of liberating Palestine “from the river to the sea” is realistic.\n\nMashaal said Hamas has used its rule of Gaza to build up the resistance and all its means. He said the weapons, the weapons production, the planning, the training and the tunnels were built, keeping their backs safe.\n\nThere are 2.3 million civilians living in Gaza, an enclave just 25 miles long.\n\nIsraeli army spokesman Daniel Hagari says Hamas has hidden its fighters in civilian infrastructure.\n\n“Hamas uses hospitals as terror infrastructures,” he said. “Hamas has turned hospitals into command-and-control centers and hideouts for Hamas terrorists and commanders.”\n\nIsraeli Prime Minister Benjamin Netanyahu says he is committed to destroying Hamas as a military power. But four months into the war, Hamas remains in control in parts of Gaza, making it unclear what the future of the enclave will be.",
        "word_match_percentage": 0.7,
        "mutual_words": [
            "health",
            "war",
            "palestinian",
            "accord",
            "israel",
            "hamas-run",
            "ministry",
            "make",
            "say",
            "gaza",
            "create",
            "people",
            "benjamin",
            "reject",
            "minister",
            "netanyahu",
            "kill",
            "death",
            "begin",
            "prime",
            "state"
        ]
    }
]